In [6]:
import pandas as pd

In [8]:
dict1 = {'name':['Anne','Angel','Dorcas','Joseph','Patience','Paul', 'Joy'], 
         'Marks':[90,89,99,87,90,83,99], 'Gender' :['Female','Female','Female',
            'Male','Female','Male','Female',]
            } 
dataf1 = pd.DataFrame(dict1) 
dataf1

       name  Marks  Gender
0      Anne     90  Female
1     Angel     89  Female
2    Dorcas     99  Female
3    Joseph     87    Male
4  Patience     90  Female
5      Paul     83    Male
6       Joy     99  Female

In [10]:
#display top 3 Rows
dataf1.head(3)

     name  Marks  Gender
0    Anne     90  Female
1   Angel     89  Female
2  Dorcas     99  Female

In [11]:
#last 3 rows
dataf1.tail(3)

       name  Marks  Gender
4  Patience     90  Female
5      Paul     83    Male
6       Joy     99  Female

In [15]:
#find shape of dataset
dataf1.shape
print("number of rows: ", dataf1.shape[0])
print("number of Colums: ", dataf1.shape[1])

number of rows:  7
number of Colums:  3

In [13]:
#get information about our dataset
dataf1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [18]:
#check null value
dataf1.isnull().sum(axis=1)
dataf1.isnull().sum(axis=0)

name      0
Marks     0
Gender    0
dtype: int64

In [20]:
#get overall statistics about dataframe
dataf1.describe()#displays statistics of numerical columns by default
dataf1.describe(include='all') #this is to include all colums

        name      Marks  Gender
count      7   7.000000       7
unique     7        NaN       2
top     Anne        NaN  Female
freq       1        NaN       5
mean     NaN  91.000000     NaN
std      NaN   5.972158     NaN
min      NaN  83.000000     NaN
25%      NaN  88.000000     NaN
50%      NaN  90.000000     NaN
75%      NaN  94.500000     NaN
max      NaN  99.000000     NaN

In [21]:
# find unique values from gender columns
dataf1['Gender'].unique()

array(['Female', 'Male'], dtype=object)

In [22]:
#find number of unique values
dataf1['Gender'].nunique()

2

In [23]:
#Dispalay count of unique values
dataf1['Gender'].value_counts()

Gender
Female    5
Male      2
Name: count, dtype: int64

In [24]:
# find total number of students having marks between 90 -100
dataf1[dataf1['Marks'] >= 90]

       name  Marks  Gender
0      Anne     90  Female
2    Dorcas     99  Female
4  Patience     90  Female
6       Joy     99  Female

In [28]:
#without between method
len(dataf1[(dataf1['Marks'] >= 90) & (dataf1['Marks'] <= 100)])

4

In [29]:
#using between method
sum(dataf1['Marks'].between(90, 100))

4

In [30]:
#Find average of marks
dataf1['Marks'].mean()

91.0

In [32]:
#using self defined methods
def half_marks(x):
    return x/2
dataf1['Marks'].apply(half_marks)

0    45.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [34]:
#adding new column for the half marks
dataf1['Half Marks']=dataf1['Marks'].apply(half_marks)
dataf1

       name  Marks  Gender  Half Marks
0      Anne     90  Female        45.0
1     Angel     89  Female        44.5
2    Dorcas     99  Female        49.5
3    Joseph     87    Male        43.5
4  Patience     90  Female        45.0
5      Paul     83    Male        41.5
6       Joy     99  Female        49.5

In [35]:
#using lambda function
dataf1['Marks'].apply(lambda x: x/2)

0    45.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [36]:
dataf1['name'].apply(len)

0    4
1    5
2    6
3    6
4    8
5    4
6    3
Name: name, dtype: int64

In [37]:
#using map Function to encode data
dataf1

       name  Marks  Gender  Half Marks
0      Anne     90  Female        45.0
1     Angel     89  Female        44.5
2    Dorcas     99  Female        49.5
3    Joseph     87    Male        43.5
4  Patience     90  Female        45.0
5      Paul     83    Male        41.5
6       Joy     99  Female        49.5

In [44]:
dataf1['Gender_Notation']=dataf1['Gender'].map({'Male': 1, 'Female': 0})
dataf1

       name  Marks  Gender  Half Marks  Gender_Notation
0      Anne     90       0        45.0              NaN
1     Angel     89       0        44.5              NaN
2    Dorcas     99       0        49.5              NaN
3    Joseph     87       1        43.5              NaN
4  Patience     90       0        45.0              NaN
5      Paul     83       1        41.5              NaN
6       Joy     99       0        49.5              NaN

In [43]:
#Encoding using the replace method
dataf1.replace({'Gender':{'Male': 1, 'Female': 0}},inplace=True)
dataf1

       name  Marks  Gender  Half Marks  Gender_Notation
0      Anne     90       0        45.0                0
1     Angel     89       0        44.5                0
2    Dorcas     99       0        49.5                0
3    Joseph     87       1        43.5                1
4  Patience     90       0        45.0                0
5      Paul     83       1        41.5                1
6       Joy     99       0        49.5                0

In [56]:
#deleting a column
dataf1.drop(['Gender_Notation', 'Half Marks'], axis=1)

       name  Marks  Gender
0      Anne     90       0
1     Angel     89       0
2    Dorcas     99       0
3    Joseph     87       1
4  Patience     90       0
5      Paul     83       1
6       Joy     99       0

In [57]:
#printing column names
dataf1.columns

Index(['name', 'Marks', 'Gender', 'Half Marks', 'Gender_Notation'], dtype='object')

In [58]:
dataf1.index

RangeIndex(start=0, stop=7, step=1)

In [59]:
dataf1.sort_values(by='Marks', ascending=False)

       name  Marks  Gender  Half Marks  Gender_Notation
2    Dorcas     99       0        49.5              NaN
6       Joy     99       0        49.5              NaN
0      Anne     90       0        45.0              NaN
4  Patience     90       0        45.0              NaN
1     Angel     89       0        44.5              NaN
3    Joseph     87       1        43.5              NaN
5      Paul     83       1        41.5              NaN

In [60]:
dataf1

       name  Marks  Gender  Half Marks  Gender_Notation
0      Anne     90       0        45.0              NaN
1     Angel     89       0        44.5              NaN
2    Dorcas     99       0        49.5              NaN
3    Joseph     87       1        43.5              NaN
4  Patience     90       0        45.0              NaN
5      Paul     83       1        41.5              NaN
6       Joy     99       0        49.5              NaN

In [63]:
dataf1[dataf1['Gender']== 0][['name', 'Marks']]

       name  Marks
0      Anne     90
1     Angel     89
2    Dorcas     99
4  Patience     90
6       Joy     99

In [65]:
dataf1[dataf1['Gender'].isin([0])] [['name', 'Marks']]

       name  Marks
0      Anne     90
1     Angel     89
2    Dorcas     99
4  Patience     90
6       Joy     99